# Напишите программу, которая запрашивает у пользователя длины двух катетов в прямоугольном треугольнике и выводит его площадь.

n = int(input('Введите количество минут: '))

print(n, 'минут — это', n // 60, 'часа/часов и', n % 60, 'минут')
